app/Http/Controllers/AllowanceController.php

    public function edit($allowance)
    {
        $allowance = Allowance::find($allowance);
---
select * from `allowances` where `allowances`.`id` = '2' limit 1