app/Http/Controllers/AllowanceOptionController.php

    public function index()
    {
        if(\Auth::user()->can('manage allowance option'))
        {
            $allowanceoptions = AllowanceOption::where('created_by', '=', \Auth::user()->creatorId())->get();
---
select * from `allowance_options` where `created_by` = 1