app/Http/Controllers/DashboardController.php

    public function hrm_dashboard_index()
    {
        if (!Auth::check()) {
            if (!file_exists(storage_path() . '/installed')) {
                header('location:install');
                die;
            }
            $settings = Utility::settings();
            if ($settings['display_landing_page'] == 'on') {
                return view('layouts.landing');
            }
            return redirect('login');
        }

        if (!\Auth::user()->can('show hrm dashboard')) {
            return $this->crm_dashboard_index();
        }

        $user = Auth::user();
        $currentDate = date('Y-m-d');
        $countUser = User::where('type', '!=', 'client')
            ->where('type', '!=', 'company')
            ->where('created_by', '=', \Auth::user()->creatorId())
            ->count();

        $countTrainer = Trainer::where('created_by', '=', \Auth::user()->creatorId())->count();
        $onGoingTraining = Training::where('status', '=', 1)->where('created_by', '=', \Auth::user()->creatorId())->count();
        $doneTraining = Training::where('status', '=', 2)->where('created_by', '=', \Auth::user()->creatorId())->count();

        $clientUsers = User::where('type', '=', 'client')->where('created_by', '=', \Auth::user()->creatorId())->get();
        $countClient = count($clientUsers);
        $notClockIn = AttendanceEmployee::where('date', '=', $currentDate)->get()->pluck('employee_id');
        $notClockIns = Employee::where('created_by', '=', \Auth::user()->creatorId())->whereNotIn('id', $notClockIn)->get();
---
select count(*) as aggregate from `users` where `type` != 'client' and `type` != 'company' and `created_by` = 1
select count(*) as aggregate from `trainers` where `created_by` = 1
select count(*) as aggregate from `trainings` where `status` = 1 and `created_by` = 1
select count(*) as aggregate from `trainings` where `status` = 2 and `created_by` = 1
select * from `users` where `type` = 'client' and `created_by` = 1
select * from `employees` where `created_by` = 1 and 1 = 1

        $activeJob = Job::where('status', 'active')->where('created_by', '=', \Auth::user()->creatorId())->count();
        $inActiveJOb = Job::where('status', 'in_active')->where('created_by', '=', \Auth::user()->creatorId())->count();

        $totalEmployees = Employee::where('created_by', '=', \Auth::user()->creatorId())->count();
        $presentToday = AttendanceEmployee::where('date', '=', $currentDate)
            ->where('clock_in', '!=', '00:00:00')
            ->count();
        $absentToday = $totalEmployees - $presentToday;

        $totalOnLeave = Leave::where('status', 'Approved')
            ->where('start_date', '<=', $currentDate)
            ->where('end_date', '>=', $currentDate)
            ->where('created_by', '=', \Auth::user()->creatorId())
            ->count();

        $pendingLeaves = Leave::where('status', 'Pending')
            ->where('created_by', '=', \Auth::user()->creatorId())
            ->count();

        $totalDepartments = Department::where('created_by', '=', \Auth::user()->creatorId())->count();
        $totalDesignations = Designation::where('created_by', '=', \Auth::user()->creatorId())->count();
---
select count(*) as aggregate from `employees` where `created_by` = 1
select count(*) as aggregate from `attendance_employees` where `date` = '2025-11-18' and `clock_in` != '00:00:00'
select count(*) as aggregate from `leaves` where `status` = 'Approved' and `start_date` <= '2025-11-18' and `end_date` >= '2025-11-18' and `created_by` = 1
select count(*) as aggregate from `leaves` where `status` = 'Pending' and `created_by` = 1
select count(*) as aggregate from `departments` where `created_by` = 1
select count(*) as aggregate from `designations` where `created_by` = 1

            $q->where('created_by', '=', \Auth::user()->creatorId());
        })->count();

        $newHiresThisMonth = Employee::where('created_by', '=', \Auth::user()->creatorId())
            ->whereMonth('created_at', date('m'))
            ->whereYear('created_at', date('Y'))
            ->count();

        $upcomingBirthdays = Employee::where('created_by', '=', \Auth::user()->creatorId())
            ->whereRaw('DATE_FORMAT(dob, "%m-%d") BETWEEN DATE_FORMAT(NOW(), "%m-%d") AND DATE_FORMAT(DATE_ADD(NOW(), INTERVAL 7 DAY), "%m-%d")')
            ->count();

        $expiringDocuments = Document::where('created_by', '=', \Auth::user()->creatorId())
            ->whereBetween('expiry_date', [$currentDate, date('Y-m-d', strtotime('+30 days'))])
            ->count();

        $last30Days = date('Y-m-d', strtotime('-30 days'));
        $totalAttendanceRecords = AttendanceEmployee::whereBetween('date', [$last30Days, $currentDate])
            ->where('clock_in', '!=', '00:00:00')
            ->count();
        $expectedAttendance = $totalEmployees * 30;
        $attendanceRate = $expectedAttendance > 0 ? round(($totalAttendanceRecords / $expectedAttendance) * 100, 1) : 0;

        $maleEmployees = Employee::where('created_by', '=', \Auth::user()->creatorId())
            ->where('gender', 'Male')
            ->count();
        $femaleEmployees = Employee::where('created_by', '=', \Auth::user()->creatorId())
            ->where('gender', 'Female')
            ->count();

        $departmentStats = Employee::select('department_id', \DB::raw('count(*) as total'))
            ->where('created_by', '=', \Auth::user()->creatorId())
            ->groupBy('department_id')
            ->orderBy('total', 'desc')
            ->limit(5)
            ->with('department')
            ->get();

        $recentLeaves = Leave::where('created_by', '=', \Auth::user()->creatorId())
            ->orderBy('created_at', 'desc')
            ->limit(5)
            ->with('employee.user')
            ->get();
---
select count(*) as aggregate from `employees` where `created_by` = 1 and month(`created_at`) = '11' and year(`created_at`) = '2025'
select count(*) as aggregate from `employees` where `created_by` = 1 and DATE_FORMAT(dob, "%m-%d") BETWEEN DATE_FORMAT(NOW(), "%m-%d") AND DATE_FORMAT(DATE_ADD(NOW(), INTERVAL 7 DAY), "%m-%d")
select count(*) as aggregate from `documents` where `created_by` = 1 and `expiry_date` between '2025-11-18' and '2025-12-18'
select count(*) as aggregate from `attendance_employees` where `date` between '2025-10-19' and '2025-11-18' and `clock_in` != '00:00:00'
select count(*) as aggregate from `employees` where `created_by` = 1 and `gender` = 'Male'
select count(*) as aggregate from `employees` where `created_by` = 1 and `gender` = 'Female'
select * from `departments` where `departments`.`id` in (0, 1, 2, 4)
select `department_id`, count(*) as total from `employees` where `created_by` = 1 group by `department_id` order by `total` desc limit 5
select * from `leaves` where `created_by` = 1 order by `created_at` desc limit 5

        ];

        if ($user->type != 'client' && $user->type != 'company') {
            $emp = Employee::where('user_id', '=', $user->id)->first();

            $announcements = Announcement::where('announcements.end_date', '>=', $currentDate)
                ->orderBy('announcements.id', 'desc')
                ->take(5)
                ->leftjoin('announcement_employees', 'announcements.id', '=', 'announcement_employees.announcement_id')
                ->where('announcement_employees.employee_id', '=', $emp->id)
                ->orWhere(function ($q) use ($emp) {
                    $q->where('announcements.department_id', '["0"]')
                        ->where('announcements.employee_id', '["0"]')
                        ->where('announcement_employees.employee_id', $emp->id);
                })
                ->get();

            $meetings = Meeting::orderBy('meetings.id', 'desc')
                ->take(5)
                ->leftjoin('meeting_employees', 'meetings.id', '=', 'meeting_employees.meeting_id')
                ->where('meeting_employees.employee_id', '=', $emp->id)
                ->orWhere(function ($q) {
                    $q->where('meetings.department_id', '["0"]')->where('meetings.employee_id', '["0"]');
                })
                ->groupBy('meetings.id')
                ->get();

            $events = Event::leftjoin('event_employees', 'events.id', '=', 'event_employees.event_id')
                ->where('event_employees.employee_id', '=', $emp->id)
                ->orWhere(function ($q) {
                    $q->where('events.department_id', '["0"]')->where('events.employee_id', '["0"]');
                })
                ->get();
---
select * from `employees` where `user_id` = 5 limit 1
select * from `announcements` left join `announcement_employees` on `announcements`.`id` = `announcement_employees`.`announcement_id` where `announcements`.`end_date` >= '2025-11-18' and `announcement_employees`.`employee_id` = 3 or (`announcements`.`department_id` = '[\"0\"]' and `announcements`.`employee_id` = '[\"0\"]' and `announcement_employees`.`employee_id` = 3) order by `announcements`.`id` desc limit 5
select * from `meetings` left join `meeting_employees` on `meetings`.`id` = `meeting_employees`.`meeting_id` where `meeting_employees`.`employee_id` = 3 or (`meetings`.`department_id` = '[\"0\"]' and `meetings`.`employee_id` = '[\"0\"]') group by `meetings`.`id` order by `meetings`.`id` desc limit 5
select * from `events` left join `event_employees` on `events`.`id` = `event_employees`.`event_id` where `event_employees`.`employee_id` = 3 or (`events`.`department_id` = '[\"0\"]' and `events`.`employee_id` = '[\"0\"]')

            }

            $date = date('Y-m-d');
            $employeeAttendance = AttendanceEmployee::orderBy('id', 'desc')
                ->where('employee_id', '=', !empty(\Auth::user()->employee) ? \Auth::user()->employee->id : 0)
                ->where('date', '=', $date)
                ->first();
---
select * from `attendance_employees` where `employee_id` = 3 and `date` = '2025-11-18' order by `id` desc limit 1
select * from `employees` where `employees`.`user_id` = 5 and `employees`.`user_id` is not null limit 1