app/Http/Controllers/DeductionOptionController.php

    public function index()
    {
        if(\Auth::user()->can('manage deduction option'))
        {
            $deductionoptions = DeductionOption::where('created_by', '=', \Auth::user()->creatorId())->with('taxSlabs')->get();
---
select * from `deduction_options` where `created_by` = 1
select `tax_slabs`.*, `deduction_option_tax_slab`.`deduction_option_id` as `pivot_deduction_option_id`, `deduction_option_tax_slab`.`tax_slab_id` as `pivot_tax_slab_id` from `tax_slabs` inner join `deduction_option_tax_slab` on `tax_slabs`.`id` = `deduction_option_tax_slab`.`tax_slab_id` where `deduction_option_tax_slab`.`deduction_option_id` in (1, 2, 3, 4)

    public function edit($deductionoption)
    {
        $deductionoption = DeductionOption::find($deductionoption);
        if(\Auth::user()->can('edit deduction option'))
        {
                if($deductionoption->created_by == \Auth::user()->creatorId())
                {
                    $tax_slabs = TaxSlab::where('created_by', \Auth::user()->creatorId())->get();
                    $selected_tax_slabs = $deductionoption->taxSlabs->pluck('id')->toArray();
---
select * from `deduction_options` where `deduction_options`.`id` = '1' limit 1
select * from `tax_slabs` where `created_by` = 1
select `tax_slabs`.*, `deduction_option_tax_slab`.`deduction_option_id` as `pivot_deduction_option_id`, `deduction_option_tax_slab`.`tax_slab_id` as `pivot_tax_slab_id` from `tax_slabs` inner join `deduction_option_tax_slab` on `tax_slabs`.`id` = `deduction_option_tax_slab`.`tax_slab_id` where `deduction_option_tax_slab`.`deduction_option_id` = 1