app/Http/Controllers/EmployeeController.php

    public function index(Request $request)
    {
        if (\Auth::user()->can('manage employee')) {
            if (Auth::user()->type == 'Employee') {
                $query = Employee::where('user_id', '=', Auth::user()->id);
            } else {
                $query = Employee::where('created_by', \Auth::user()->creatorId());
            }

            // Apply filters
            if($request->has('branch_id') && !empty($request->branch_id))
            {
                $query->where('branch_id', $request->branch_id);
            }

            if($request->has('department_id') && !empty($request->department_id))
            {
                $query->where('department_id', $request->department_id);
            }

            if($request->has('designation_id') && !empty($request->designation_id))
            {
                $query->where('designation_id', $request->designation_id);
            }

            $employees = $query->with(['branch', 'department', 'designation'])->get();
---
select * from `branches` where `branches`.`id` in (0, 1, 2, 5)
select * from `departments` where `departments`.`id` in (0, 1, 2, 4)
select * from `designations` where `designations`.`id` in (0, 1, 2, 5, 9)
select * from `employees` where `created_by` = 1 and `branch_id` = '1'

    public function edit($id)
    {
        try{
            $id = Crypt::decrypt($id);
        } catch (\Exception $e){
            return redirect()->back()->with('error', __('Something went wrong.'));
        }
        if (\Auth::user()->can('edit employee')) {
            $documents = Document::where('created_by', \Auth::user()->creatorId())->get();
            $branches = Branch::where('created_by', \Auth::user()->creatorId())->get()->pluck('name', 'id');
            $branches->prepend('Select Branch', '');
            $departments = Department::where('created_by', \Auth::user()->creatorId())->get()->pluck('name', 'id');
            $designations = Designation::where('created_by', \Auth::user()->creatorId())->get()->pluck('name', 'id');
            $employee = Employee::with('identifications')->find($id);
            $employeesId = \Auth::user()->employeeIdFormat(!empty($employee->employee_id) ? $employee->employee_id : '');
            $departmentData = Department::where('created_by', \Auth::user()->creatorId())->where('branch_id', $employee->branch_id)->get()->pluck('name', 'id');
            $identifications = $employee->identifications;
            $idTypes = $this->idTypeOptions();
            $managers = Employee::where('created_by', \Auth::user()->creatorId())->get();
---
select * from `documents` where `created_by` = 1
select * from `employees` where `employees`.`id` = 1 limit 1
select * from `employees` where `created_by` = 1

    public function destroy($id)
    {

        if (Auth::user()->can('delete employee')) {
            $employee = Employee::findOrFail($id);
---
select * from `employees` where `employees`.`id` = 11 limit 1

    public function show($id)
    {
        if (\Auth::user()->can('view employee')) {
            try {
                $empId = Crypt::decrypt($id);
                $employee     = Employee::with('identifications')->findOrFail($empId);
            } catch (\Throwable $th) {
                return redirect()->back()->with('error', __('Employee Not Found.'));
            }
            $documents = Document::where('created_by', \Auth::user()->creatorId())->get();
            $branches = Branch::where('created_by', \Auth::user()->creatorId())->get()->pluck('name', 'id');
            $branches->prepend('Select Branch', '');
            $departments = Department::where('created_by', \Auth::user()->creatorId())->get()->pluck('name', 'id');
            $designations = Designation::where('created_by', \Auth::user()->creatorId())->get()->pluck('name', 'id');


            $employeesId = \Auth::user()->employeeIdFormat(!empty($employee->employee_id) ? $employee->employee_id : '');
            $lastPayslip = PaySlip::where('employee_id', $employee->id)->latest('id')->first();
---
select * from `employees` where `employees`.`id` = 11 limit 1
select * from `documents` where `created_by` = 1
select * from `pay_slips` where `employee_id` = 11 order by `id` desc limit 1

    public function toggleLogin($id)
    {
        try {
            $employee = Employee::findOrFail($id);

            if (!\Auth::user()->can('edit employee')) {
                return redirect()->back()->with('error', __('Permission denied.'));
            }

            if ($employee->created_by != \Auth::user()->creatorId()) {
                return redirect()->back()->with('error', __('Permission denied.'));
            }

            // Check if employee has a user account
            if (!$employee->user_id) {
                // Create a user account for the employee
                $user = User::create([
                    'name' => $employee->name,
                    'email' => $employee->email,
                    'password' => Hash::make($employee->password ?? 'password123'), // Use employee password or default
                    'email_verified_at' => date('Y-m-d H:i:s'),
                    'type' => 'Employee',
                    'lang' => 'en',
                    'is_enable_login' => 1,
                    'created_by' => \Auth::user()->creatorId(),
                ]);
---
select * from `employees` where `employees`.`id` = '11' limit 1
insert into `users` (`name`, `email`, `password`, `type`, `lang`, `is_enable_login`, `created_by`, `updated_at`, `created_at`) values ('Obed Kalunga', '', '$2y$10$OGmtjMcWq8QXzxEZ4pHDJu/FIITjcOAoK/k0Yu78NlBIgF6p.L3FO', 'Employee', 'en', 1, 1, '2025-11-18 16:21:22', '2025-11-18 16:21:22')


                // Update employee with user_id
                $employee->user_id = $user->id;
                $employee->save();
---
update `employees` set `user_id` = 9, `employees`.`updated_at` = '2025-11-18 16:21:23' where `id` = 11

                // Toggle login access
                $user = $employee->user;
                $user->is_enable_login = !$user->is_enable_login;
                $user->save();
---
update `users` set `is_enable_login` = 0, `users`.`updated_at` = '2025-11-18 16:21:31' where `id` = 9