app/Http/Controllers/PayslipTypeController.php

select * from `payslip_types` where `created_by` = 1
select * from `tax_slabs` where `tax_slabs`.`payslip_type_id` in (1)
---
    public function index()
    {
        if(\Auth::user()->can('manage payslip type'))
        {
            $paysliptypes = PayslipType::where('created_by', '=', \Auth::user()->creatorId())->with('taxSlabs')->get();

select * from `tax_slabs` where `created_by` = 1
---
    public function create()
    {
        if(\Auth::user()->can('create payslip type'))
        {
            $tax_slabs = TaxSlab::where('created_by', \Auth::user()->creatorId())->get();

insert into `payslip_types` (`name`, `created_by`, `updated_at`, `created_at`) values ('Engineers', 1, '2025-11-18 17:25:01', '2025-11-18 17:25:01')
---
    public function store(Request $request)
    {

        if(\Auth::user()->can('create payslip type'))
        {

            $validator = \Validator::make(
                $request->all(), [
                                   'name' => 'required|max:20',
                                   'tax_slabs' => 'nullable|array',
                                   'tax_slabs.*' => [
                                       Rule::exists('tax_slabs', 'id')->where('created_by', \Auth::user()->creatorId()),
                                   ],
                                   'allowance_options' => 'nullable|array',
                                   'deduction_options' => 'nullable|array',
                               ]
            );
            if($validator->fails())
            {
                $messages = $validator->getMessageBag();

                return redirect()->back()->with('error', $messages->first());
            }
            $paysliptype             = new PayslipType();
            $paysliptype->name       = $request->name;
            $paysliptype->created_by = \Auth::user()->creatorId();
            $paysliptype->save();

select * from `tax_slabs` where `created_by` = 1
select `id` from `tax_slabs` where `tax_slabs`.`payslip_type_id` = 5 and `tax_slabs`.`payslip_type_id` is not null
select `allowance_options`.`id` from `allowance_options` inner join `payslip_type_allowance_option` on `allowance_options`.`id` = `payslip_type_allowance_option`.`allowance_option_id` where `payslip_type_allowance_option`.`payslip_type_id` = 5
select `deduction_options`.`id` from `deduction_options` inner join `payslip_type_deduction_option` on `deduction_options`.`id` = `payslip_type_deduction_option`.`deduction_option_id` where `payslip_type_deduction_option`.`payslip_type_id` = 5
---
    public function edit(PayslipType $paysliptype)
    {
        if(\Auth::user()->can('edit payslip type'))
        {
            if($paysliptype->created_by == \Auth::user()->creatorId())
            {
                try {
                    $tax_slabs = TaxSlab::where('created_by', \Auth::user()->creatorId())->get();
                    $selected_tax_slabs = $paysliptype->taxSlabs()->pluck('id')->toArray();

                    $allowance_options = \App\Models\AllowanceOption::where('created_by', \Auth::user()->creatorId())->get()->pluck('name', 'id');
                    $deduction_options = \App\Models\DeductionOption::where('created_by', \Auth::user()->creatorId())->get()->pluck('name', 'id');

                    $selected_allowances = $paysliptype->allowanceOptions()->pluck('allowance_options.id')->toArray();
                    $selected_deductions = $paysliptype->deductionOptions()->pluck('deduction_options.id')->toArray();

update `tax_slabs` set `payslip_type_id` = '', `tax_slabs`.`updated_at` = '2025-11-18 17:25:01' where `created_by` = 1 and `payslip_type_id` = 4 and `id` not in ('2', '4', '3', '1')
update `tax_slabs` set `payslip_type_id` = 4, `tax_slabs`.`updated_at` = '2025-11-18 17:25:01' where `created_by` = 1 and `id` in ('2', '4', '3', '1')
---
    protected function syncTaxSlabs(PayslipType $paysliptype, array $taxSlabIds)
    {
        $taxSlabIds = array_values(array_filter($taxSlabIds));
        $creatorId = \Auth::user()->creatorId();

        $detachQuery = TaxSlab::where('created_by', $creatorId)
            ->where('payslip_type_id', $paysliptype->id);

        if (!empty($taxSlabIds)) {
            $detachQuery->whereNotIn('id', $taxSlabIds);
        }

        $detachQuery->update(['payslip_type_id' => null]);

        if (!empty($taxSlabIds)) {
            TaxSlab::where('created_by', $creatorId)
                ->whereIn('id', $taxSlabIds)
                ->update(['payslip_type_id' => $paysliptype->id]);