app/Http/Controllers/SetSalaryController.php

select * from `employees` where (`created_by` = 1)
---
    public function index()
    {
        if(\Auth::user()->can('manage set salary'))
        {
            $employees = Employee::where(
                [
                    'created_by' => \Auth::user()->creatorId(),
                ]
            )->with('salaryType')->get();

select * from `allowances` where `employee_id` = '16'
select * from `commissions` where `employee_id` = '16'
select * from `loans` where `employee_id` = '16'
select * from `saturation_deductions` where `employee_id` = '16'
select * from `other_payments` where `employee_id` = '16'
select * from `overtimes` where `employee_id` = '16'
select * from `employees` where `employees`.`id` = '16' limit 1
select * from `tax_slabs` where `created_by` = 1
---
    public function edit($id)
    {
        if(\Auth::user()->can('edit set salary'))
        {

            $payslip_type      = PayslipType::where('created_by', \Auth::user()->creatorId())->get()->pluck('name', 'id');
            $allowance_options = AllowanceOption::where('created_by', \Auth::user()->creatorId())->get()->pluck('name', 'id');
            $loan_options      = LoanOption::where('created_by', \Auth::user()->creatorId())->get()->pluck('name', 'id');
            $deduction_options = DeductionOption::where('created_by', \Auth::user()->creatorId())->get()->pluck('name', 'id');
            if(\Auth::user()->type == 'Employee')
            {
                $currentEmployee      = Employee::where('user_id', '=', \Auth::user()->id)->first();
                $allowances           = Allowance::where('employee_id', $currentEmployee->id)->get();
                $commissions          = Commission::where('employee_id', $currentEmployee->id)->get();
                $loans                = Loan::where('employee_id', $currentEmployee->id)->get();
                $saturationdeductions = SaturationDeduction::where('employee_id', $currentEmployee->id)->get();
                $otherpayments        = OtherPayment::where('employee_id', $currentEmployee->id)->get();
                $overtimes            = Overtime::where('employee_id', $currentEmployee->id)->get();
                $employee             = Employee::where('user_id', '=', \Auth::user()->id)->first();

                $tax_slabs = TaxSlab::where('created_by', \Auth::user()->creatorId())->get();
                return view('setsalary.employee_salary', compact('employee', 'payslip_type', 'allowance_options', 'commissions', 'loan_options', 'overtimes', 'otherpayments', 'saturationdeductions', 'loans', 'deduction_options', 'allowances', 'tax_slabs'));

            }
            else
            {
                $allowances           = Allowance::where('employee_id', $id)->get();
                $commissions          = Commission::where('employee_id', $id)->get();
                $loans                = Loan::where('employee_id', $id)->get();
                $saturationdeductions = SaturationDeduction::where('employee_id', $id)->get();
                $otherpayments        = OtherPayment::where('employee_id', $id)->get();
                $overtimes            = Overtime::where('employee_id', $id)->get();
                $employee             = Employee::find($id);

                $tax_slabs = TaxSlab::where('created_by', \Auth::user()->creatorId())->get();

select * from `allowances` where `employee_id` = '1'
select * from `commissions` where `employee_id` = '1'
select * from `loans` where `employee_id` = '1'
select * from `saturation_deductions` where `employee_id` = '1'
select * from `other_payments` where `employee_id` = '1'
select * from `overtimes` where `employee_id` = '1'
select * from `employees` where `employees`.`id` = '1' limit 1
---
        }
        else
        {
            $allowances           = Allowance::where('employee_id', $id)->get();
            $commissions          = Commission::where('employee_id', $id)->get();
            $loans                = Loan::where('employee_id', $id)->get();
            $saturationdeductions = SaturationDeduction::where('employee_id', $id)->get();
            $otherpayments        = OtherPayment::where('employee_id', $id)->get();
            $overtimes            = Overtime::where('employee_id', $id)->get();
            $employee             = Employee::find($id);

select * from `tax_slabs` where `created_by` = 1
---
                }
            }

            $tax_slabs = TaxSlab::where('created_by', \Auth::user()->creatorId())->get();

select * from `employees` where `employees`.`id` = '1' limit 1
update `employees` set `salary_type` = '1', `salary` = '8500.00', `employees`.`updated_at` = '2025-11-19 10:37:50' where `id` = 1
---
    public function employeeUpdateSalary(Request $request, $id)
    {
        $validator = \Validator::make(
            $request->all(), [
                               'salary_type' => 'required',
                               'salary' => 'required',
                           ]
        );
        if($validator->fails())
        {
            $messages = $validator->getMessageBag();

            return redirect()->back()->with('error', $messages->first());
        }
        $employee = Employee::findOrFail($id);
        $input    = $request->all();
        $employee->fill($input)->save();

select * from `employees` where `employees`.`id` = '1' limit 1
select * from `payslip_types` where `payslip_types`.`id` = '1' limit 1
select `allowance_option` from `allowances` where `employee_id` = 1
---
    public function applyAllowances(Request $request)
    {
        try {
            $employee = Employee::find($request->employee_id);
            $payslipType = PayslipType::find($request->payslip_type_id);

            if (!$employee || !$payslipType) {
                return response()->json([
                    'success' => false,
                    'message' => __('Employee or Payslip Type not found.')
                ]);
            }

            $allowanceOptions = $payslipType->allowanceOptions;

            if ($allowanceOptions->isEmpty()) {
                return response()->json([
                    'success' => false,
                    'message' => __('No allowance options configured in this payslip type.')
                ]);
            }

            // Get existing allowances for this employee
            $existingAllowances = Allowance::where('employee_id', $employee->id)
                ->pluck('allowance_option')
                ->toArray();

insert into `allowances` (`employee_id`, `allowance_option`, `title`, `amount`, `created_by`, `updated_at`, `created_at`) values (1, 1, 'Transport Allowance', 0, 1, '2025-11-19 04:34:00', '2025-11-19 04:34:00')
---
                    $allowance->title = $option->name;
                    $allowance->amount = $option->amount ?? 0;
                    $allowance->created_by = \Auth::user()->creatorId();
                    $allowance->save();