app/Models/Employee.php

select * from `allowances` where `allowances`.`employee_id` = 1 and `allowances`.`employee_id` is not null
select * from `commissions` where `commissions`.`employee_id` = 1 and `commissions`.`employee_id` is not null
select * from `loans` where `loans`.`employee_id` = 1 and `loans`.`employee_id` is not null
select * from `saturation_deductions` where `saturation_deductions`.`employee_id` = 1 and `saturation_deductions`.`employee_id` is not null
select * from `other_payments` where `other_payments`.`employee_id` = 1 and `other_payments`.`employee_id` is not null
select * from `overtimes` where `overtimes`.`employee_id` = 1 and `overtimes`.`employee_id` is not null
---
    public function get_net_salary()
{
    // Load related data efficiently using Eloquent relationships

    // Calculate total allowances
    $total_allowance = $this->allowances->sum(function ($allowance) {
        return ($allowance->type === 'fixed') ? $allowance->amount : ($allowance->amount * $this->salary / 100);
    });

    // Calculate total commissions
    $total_commission = $this->commissions->sum(function ($commission) {
        return ($commission->type === 'fixed') ? $commission->amount : ($commission->amount * $this->salary / 100);
    });

    // Calculate total loans
    $total_loan = $this->loans->sum(function ($loan) {
        return ($loan->type === 'fixed') ? $loan->amount : ($loan->amount * $this->salary / 100);
    });

    // Calculate total saturation deductions
    $total_saturation_deduction = $this->saturationDeductions->sum(function ($deduction) {
        return ($deduction->type === 'fixed') ? $deduction->amount : ($deduction->amount * $this->salary / 100);
    });

    // Calculate total other payments
    $total_other_payment = $this->otherPayments->sum(function ($otherPayment) {
        return ($otherPayment->type === 'fixed') ? $otherPayment->amount : ($otherPayment->amount * $this->salary / 100);
    });

    // Calculate total overtime
    $total_over_time = $this->overtimes->sum(function ($over_time) {
        return $over_time->number_of_days * $over_time->hours * $over_time->rate;
    });