app/Models/Utility.php

    public static function getSetting()
    {
        if (self::$getsettings == null) {
            $data = DB::table('settings');
            $data = $data->where('created_by', '=', 2)->get();
            if (count($data) == 0) {
                $data = DB::table('settings')->where('created_by', '=', 1)->get();
---
select * from `settings` where `created_by` = 2
select * from `settings` where `created_by` = 1

    public static function getSettingById($id)
    {
        // if (self::$getsettingsid == null) {
            $data = DB::table('settings');
            $data = $data->where('created_by', '=', $id)->get();
---
select * from `settings` where `created_by` = 1

    public static function languages()
    {
        if (self::$langData == null) {
            $languages = Utility::langList();

            if (\Schema::hasTable('languages')) {
                $settings = Utility::settings();
                if (!empty($settings['disable_lang'])) {
                    $disabledlang = explode(',', $settings['disable_lang']);
                    $languages = Language::whereNotIn('code', $disabledlang)->pluck('full_name', 'code');
                } else {
                    $languages = Language::pluck('full_name', 'code');
---
select `full_name`, `code` from `languages`

    public static function addNewAccountData()
    {
        $users = User::where('type','company')->get();

        foreach($users as $user)
        {
            $chartOfAccountTypes = Self::$chartOfAccountType;
            foreach($chartOfAccountTypes as $k => $type) {
                $check_type = ChartOfAccountType::where('created_by', $user->id)->where('name', $type)->first();

                $chartOfAccountSubTypes = Self::$chartOfAccountSubType;
                foreach ($chartOfAccountSubTypes[$k] as $subType) {
                    $check_subtype = ChartOfAccountSubType::where('created_by', $user->id)->where('type', $check_type->id)->where('name', $subType)->first();
---
select * from `users` where `type` = 'company'
select * from `chart_of_account_types` where `created_by` = 1 and `name` = 'Assets' limit 1
select * from `chart_of_account_sub_types` where `created_by` = 1 and `type` = 1 and `name` = 'Accounts Receivable' limit 1


        ];
        foreach ($arrPermissions as $ap) {
            // check if permission is not created then create it.
            $permission = Permission::where('name', 'LIKE', $ap)->first();
---
select * from `permissions` where `name` LIKE 'manage form builder' limit 1

                Permission::create(['name' => $ap]);
            }
        }
        $companyRole = Role::where('name', 'LIKE', 'company')->first();
---
select * from `roles` where `name` LIKE 'company' limit 1

    public static function getCompanyPaymentSetting($user_id)
    {

        $data = \DB::table('company_payment_settings');
        $settings = [];
        $data = $data->where('created_by', '=', $user_id);
        $data = $data->get();
---
select * from `company_payment_settings` where `created_by` = 1

    public static function colorset()
    {
        if (\Auth::check()) {
            $setting = DB::table('settings')->where('created_by', \Auth::user()->creatorId())->pluck('value', 'name')->toArray();
        } else {

            $user = User::where('type', 'company')->first();
            $setting = DB::table('settings')->where('created_by', $user->id)->pluck('value', 'name')->toArray();
---
select `value`, `name` from `settings` where `created_by` = 1
select * from `users` where `type` = 'company' limit 1

    public static function getSeoSetting()
    {
        $data = \DB::table('settings')->whereIn('name', ['meta_title', 'meta_desc', 'meta_image'])->get();
---
select * from `settings` where `name` in ('meta_title', 'meta_desc', 'meta_image')

    public static function getCookieSetting()
    {

        $data = \DB::table('settings')->whereIn('name', ['enable_cookie', 'cookie_logging', 'cookie_title',
            'cookie_description', 'necessary_cookies', 'strictly_cookie_title',
            'strictly_cookie_description', 'more_information_description', 'contactus_url'])->get();
---
select * from `settings` where `name` in ('enable_cookie', 'cookie_logging', 'cookie_title', 'cookie_description', 'necessary_cookies', 'strictly_cookie_title', 'strictly_cookie_description', 'more_information_description', 'contactus_url')

    public static function languagecreate()
    {
        $languages = Utility::langList();

        foreach ($languages as $key => $lang) {
            $languageExist = Language::where('code', $key)->first();
---
select * from `languages` where `code` = 'ar' limit 1